In [43]:
#Assignment 10.1 PANDAS CONTD.

import os
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

url="https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv"
dataSet=pd.read_csv(url,sep=',')
dataSet.head(6)

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41
5       11354  11355  Abigail  2004      F    AK     37

In [11]:
rows,cols=dataSet.shape
print(rows)
print(cols)

1016395
7

In [12]:
dataSet["Name"].head(5)  #dataSet.Name is same

0       Emma
1    Madison
2     Hannah
3      Grace
4      Emily
Name: Name, dtype: object

In [14]:
dataSet.columns

Index(['Unnamed: 0', 'Id', 'Name', 'Year', 'Gender', 'State', 'Count'], dtype='object')

In [45]:
#1. Delete Unnamed Columns
dataSet.drop('Unnamed: 0',axis=1,inplace=True)
dataSet.head(5)

      Id     Name  Year Gender State  Count
0  11350     Emma  2004      F    AK     62
1  11351  Madison  2004      F    AK     48
2  11352   Hannah  2004      F    AK     46
3  11353    Grace  2004      F    AK     44
4  11354    Emily  2004      F    AK     41

In [59]:
#2.Distribution of Male and Females
byGender=dataSet.groupby('Gender')
#byGender['Count'].describe()
byGender['Count'].sum()

Gender
F    16380293
M    19041199
Name: Count, dtype: int64

In [61]:
#3. Show the top 5 most preferred names
print('The top 5 most preferred names are :')
byNames=dataSet.groupby(['Name'])
byNames['Count'].apply(lambda x: x.sum()).nlargest(5)

The top 5 most preferred names are :

Name
Jacob       242874
Emma        214852
Michael     214405
Ethan       209277
Isabella    204798
Name: Count, dtype: int64

In [108]:
#4  What is the median name occurence in the dataset
median_Id = int(dataSet['Id'].median())
median_ix=dataSet.index[dataSet['Id'] == median_Id]
print('The median name occurance in the dataset is :')
dataSet['Name'].loc[median_ix]

The median name occurance in the dataset is :

508197    Kasey
Name: Name, dtype: object

In [116]:
#5. Distribution of male and female born count by states
byGenderState=dataSet.groupby(['Gender','State'])
byGenderState.groups
print("Distribution of male and female born count by states is :")
byGenderState['Count'].apply(lambda x:x.sum())

Distribution of male and female born count by states is :

Gender  State
F       AK         26250
        AL        215308
        AR        129712
        AZ        368567
        CA       2414063
        CO        260805
        CT        141350
        DC         35276
        DE         31312
        FL        915422
        GA        549637
        HI         37279
        IA        144764
        ID         72808
        IL        695312
        IN        344962
        KS        147216
        KY        210201
        LA        221859
        MA        294236
        MD        269915
        ME         43718
        MI        480990
        MN        276884
        MO        307848
        MS        127343
        MT         31622
        NC        501151
        ND         30054
        NE         88998
                  ...
M       ME         55650
        MI        557090
        MN        318917
        MO        364924
        MS        160800
        MT         44143
        NC        577529
        ND         39507
        NE        112369
        NH         56482
        NJ        487900
        NM        113542
        NV        156037
        NY       1172145
        OH        688343
        OK        228613
        OR        209445
        PA        682709
        RI         47939
        SC        237442
        SD         45443
        TN        398615
        TX       2005394
        UT        245324
        VA        466873
        VT         21353
        WA        395377
        WI        311758
        WV         93557
        WY         21912
Name: Count, Length: 102, dtype: int64